package edu.kh.array;

public class memo {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		
		// HEAP에 new 저장
		
		
		// 배열의 정의를 말하시오 
		// 같은 자료형의 변수를 하나의 묶음으로 다루는것
		// 배열은 저장된 값마다 인덱스 번호가 0부터 시작하여 설정
		
		// 배열의 특징
		// 1. 한가지 자료형만 저장가능
		// 2. 여러값 저장가능
		// 3. 한번 크기를 지정하면 변경 불가능
		
		// 변수 : 메모리에 값을 저장할 수 있는 공간
		// 변수 선언 : 메모리에 값을 저장할 수 있는 공간을 할당
		// ** 배열
		// * 변수와 의미가 조금 다름.
		// 배열선언 : 메모리에 배열을 참조하는 변수공간 할당
		//          (값 직접 지정X, 배열의 주소를 저장)
		
		// 배열할당 : 실제 값을 저장할 수 있는 배열을 메모리에 작성
	}

}
